[
  {
    "id": 1,
	"topik": "Hijrah Nabi Ke Madinah",
    "isi": "Hijrah Rasulullah Shallallahu ‘alaihi wa sallam dan kaum muslimin ini bukan tanpa alasan. Ada berbagai faktor yang menjadi pemicu untuk melakukan hijrah. Pertama, karena adanya siksaan dan tekanan dari kaum kafir Quraisy. Begitu Rasulullah Shallallahu ‘alaihi wa sallam melakukan dakwah secara terbuka, berbagai ancaman mulai diarahkan kepada beliau Shallallahu ‘alaihi wa sallam dan orang-orang beriman yang mengikutinya. Oleh karena itu, Rasulullah Shallallahu ‘alaihi wa sallam senantiasa berpikir untuk mencari perlindungan di luar Makkah. Sehingga terjadilah hijrah kaum muslimin ke Habsyah, Thaif, dan kemudian ke Madinah.Penyebab hijrah ini, di antaranya karena penyiksaan dan penindasan kaum kafir Quraisy atas kaum muslimin. Kedua, adanya kekuatan yang akan membantu dan melindungi dakwah, sehingga memungkinkan Rasulullah Shallallahu ‘alaihi wa sallam berdakwah dengan leluasa. Hal ini sebagaimana tertuang dalam nash Bai’atul-‘Aqabah kedua. Yaitu kaum Anshâr berjanji akan melindungi Rasulullah Shallallahu ‘alaihi wa sallam sebagaimana melindungi anak dan istri mereka. Ketiga, para pembesar kaum Quraisy dan sebagian besar masyarakat Makkah menganggap Rasulullah Shallallahu ‘alaihi wa sallam sebagai pendusta, sehingga mereka tidak mempercayainya. Dengan kondisi seperti ini, maka beliau Shallallahu ‘alaihi wa sallam ingin mendakwahkan kepada masyarakat lainnya yang mau menerimanya. Keempat, kaum muslimin khawatir agama mereka terfitnah. Itulah beberapa faktor yang mendorong kaum muslimin berhijrah, meninggalkan negeri Makkah menuju negeri yang baru, yaitu Madinah. Semua ini dilakukan untuk mendapatkan ridha Allah Azza wa Jalla. Nash-nash yang shahîh menunjukkan, pilihan Rasulullah Shallallahu ‘alaihi wa sallam menetapkan Madinah sebagai negeri hijrah kaum muslimin, merupakan pilihan yang berdasarkan wahyu ilahi. Imam Bukhaari menyebutkan, yang pertama kali berangkat hijrah ke Madinah ialah Mush’ab bin Umair dan ‘Abdullah bin Ummi Maktûm. Sedangkan Ibnu Ishâq[9] dan Ibnu Sa’ad menyebutkan, yang pertama kali berhijrah ialah Abu Salamah bin al Asad. Musa bin ‘Uqbah memilih yang kedua. Ibnu Hajar menyebutkan, di antara hadits-hadits yang dibawakan penulis kitab al-Maghazi, Syiyar, dan hadits-hadits yang dibawakan oleh Imam al-Bukhâri masih bisa dipertemukan, dengan membawa pengertian “yang pertama kali” pada sisi tertentu. Yaitu Abu Salamah meninggalkan Makkah tidak dengan niatan menetap di Madinah, namun hanya menghindari penindasan kaum kafir Quraisy. Berbeda dengan Mush’ab yang memang sejak awal berniat menetap di Madinah untuk memberi pengajaran kepada penduduk Madinah atas perintah Rasulullah Shallallahu ‘alaihi wa sallam. Jadi, masing-masing di antara dua orang ini dilihat dari satu sisi. Abu Salamah ialah orang yang pertama kali hijrah ke Madinah untuk menghindari penindasan kaum kafir Quraisy. Sedangkan Mush’ab ialah orang yang pertama kali hijrah ke Madinah dengan niat menetap di Madinah. Kemudian setelah itu, kaum muslimin berdatangan ke Madinah. Bilal bin Rabbah datang bersama Sa’ad bin Abi Waqâsh dan ‘Ammâr bin Yâsir, kemudian menyusul ‘Umar bin al-Khaththab. Melihat kaum muslimin melakukan hijrah ke Madinah, bagaimanakah sikap kaum kafir Quraisy? Pemandangan ini sangat menyakitkan hati kaum kafir Quraisy. Sehingga mendorong mereka melakukan berbagai upaya untuk menghalangi kaum muslimin hijrah. Misalnya dengan menahan harta kaum muslimin dan melarang membawanya. Terkadang dengan menahan dan mengurung sebagian anggota keluarga kaum muslimin. Disamping itu, mereka juga melakukan supaya kaum muslimin yang sudah berada di Madinah kembali ke Makkah. Namun upaya kaum kafir Quraisy ini tidak membuat kaum muslimin bergeming dari niat semula. Mereka benar-benar sudah siap berpisah dengan harta benda miliknya, keluarganya, dan kenikmatan dunia dan penghidupan lainnya yang telah mereka peroleh di Makkah, demi menyambut panggilan aqidah. Dan sungguh, hijrah ini menjadi pijakan pertama berkibarnya panji tauhid."
  },
  {
    "id": 2,
	"topik": "Perang Badar",
    "isi": "Adalah pada hari jum’at tanggal tujuh belas bulan ramadhan pada tahun dua hijriyah terjadinya perang Badar pada musim panas, pada hari ketika bertemu dimedan pertempuran antara dua kelompok, golongannya Allah dan golongannya setan.Tatkala fajar merekah, membelah kegelapan malam, dipagi hari itu Nabi shalallahu ‘alaihi wa sallam menyuruh Bilal untuk memanggil para sahabatnya; ‘Sholat wahai hamba Allah’. Selanjutnya beliau sholat shubuh bersama mereka. Seusai sholat beliau memberi arahan untuk berangkat perang, membentuk barisan untuk para sahabatnya, kemudian memberi arahan, strategi dan perintah sebagaimana biasa pimpinan perang memberikan arahan kepada pasukannya sebelum berangkat ke medan tempur. Setelah itu beliau shalallahu ‘alaihi wa sallam berpaling menuju ketempat pimpinan pasukan, pada saat itu sebuah tenda yang dibikin khusus untuknya, yang semisal dengan ruang rapat para komando pasukan pada zaman sekarang. Beliau disana sambil menunggu tanda-tanda datangnya pasukan musuh, dan membiarkan para sahabat untuk berpikir, bagaimana mengatur strategi menghadapi musuh, dan memulai peperangan dengan orang yang aniaya dan lalim. Dimana Nabi shalallahu ‘alaihi wa sallam telah mengabarkan bahwa orang yang dholim pasti akan terkalahkan, dan pasukan yang aniaya pasti kalah, sedang orang yang terdholomi pasti ditolong. Dan Nabi shalallahu ‘alaihi wa sallam sebelumnya telah memerintahkan para sahabatnya supaya menggali sumur disekitar Badar yang kemudian dipendam dan ditutupi. Kemudian membangun kolam disekitar sumur yang bisa mengumpulkan air sehingga menjadi penuh, dan Badar adalah tempat berkumpulnya manusia, di sana ada pasar dari pasar-pasar Jahiliyah, yang berada diruas-ruas jalan disekitarnya, yang mana banyak orang arab yang mendatangi tempat tersebut dari tiap daerah. Dan tempat itu sekarang dari madinah kurang lebih sejauh seratus lima puluh tiga kilo meter. Pertama kali orang yang menyulut terjadi peperangan adalah al-Asad bin Abdul Asad al-Makhzumi, seorang laki-laki sadis dan berperangai buruk. Dia keluar sembari berkata: “Aku berjanji kepada Allah, sungguh aku akan meminum dari telaga mereka atau aku hancurkan telaga tersebut atau aku mati karenanya”.Melihat hal tersebut, maka Hamzah bin Abdul Muthalib keluar, manakala keduanya saling berhadapan maka Hamzah berhasil memukulnya, lalu menebas kakinya pada pertengahan betis sementara dia belum mencapai telaga, diapun tersungkur dalam kondisi terlentang dan kakinya memuncratkan darah hingga mengenai para rekannya. Kemudian dia merangkak menuju telaga hingga akhirnya tercebut disitu. Dia rupanya ingin menepati sumpahnya akan tetapi hal itu gagal terlaksana karena Hamzah melayangkan tebasan untuk yang kedua kalinya tatkal dia berada ditelaga itu. Kemudian sekelompok tentara Quraisy, dan diantara mereka ada Hakim bin Hizam, pergi menuju telaga yang dibuat oleh Rasulullah shalallahu ‘alaihi wa sallam. Duel satu lawan satu merupaka pembuka dalam peperangan Badar, dan merupakan kebiasaan mereka kalau dalam duel ini tidak ada yang keluar melainkan orang-orang kesatria ditengah-tengah pasukan, dan inilah yang terjadi diperang Badar. Dan diriwayatkan oleh Bukhari dengan sanadnya yang sampai pada Abu Ishaq, bahwa seseorang yang bertanya kepada Bara’ bin Azib sedang saya mendengar disisinya, orang itu bertanya: ‘Apakah Ali ikut perang Badar? Beliau menjawab: “Betul, bahkan dirinya duel satu lawan satu bersama musuh dan beliau ketika itu memakai baju besi”. Abu Dawud meriwayatkan dari Ali radhiyallahu ‘anhu, beliau bercerita: “Maka Utbah bin Rabi’ah dan saudaranya serta anaknya tampil kedepan, lalu Utbah menantang: ‘Siapakah berikutnya’. Maka tampilah tiga orang pemuda dari kalangan Anshar. Kemudian para penantang berkata: ‘Siapakah kalian? Mereka pun memberi tahu identitasnya. Utbah berkata: ‘Kami tidak butuh orang-orang seperti kalian, yang kami butuhkan adalah anak-anak paman kami sendiri’. Kemudian Hamzah berhadapang dengan Utbah, adapun saya berhadapan dengan Syaibah. Sedangkan Ubaidah dan rivalnya sama-sama berhasil melayangkan dua tikaman ke arah lawan masing-masing sehingga membuat keduanya luka parah. Kemudian kami menyongsong Walid sampai dirinya terbunuh,  lalu kami mengendong Ubaidah (yang terputus kakinya). Abu Jahal laknatullah meregang maut. Abu Jahal Amr bin Hisyam sang thagut, gembong pelawan kebenaran, rangkaian kelalimannya sangatlah banyak, dan contohnya banyak sekali. Sesungguhnya Fir’aunnya Musa terhenti kelalimannya manakala tenggelam bersama bala tentaranya, kaumnya Hud, Sholeh, dan Luth semuanya binasa. Dan tiap orang lalim lagi sombong harus berakhir kehidupannya dengan sesuatu yang menyiksa. Akhirnya kisah kekejaman Abu Jahal pun usai, dirinya dijebloskan kedalam sumur dengan meninggalkan keangkuhan serta kesombongannya untuk mempertahankan kebatilan melawan kebenaran. Namun, perjalanan kisah anak manusia tetap membuktikan bahwa yang namanya kebenaran pasti akan terus langgeng. Dan dahulu dikatakan: “Dinasti kebatilan hanyalah sementara sedangkan dinasti kebenaran akan tetap sampai hari kiamat”. Diriwayatkan oleh Bukhari dan Muslim dari Abdurahman bin Auf radhiyallahu ‘anhu beliau bercerita: “Aku berada di dalam barisan pasukan pada saat perang Badar berkecamuk. Tiba-tiba disebalah kanan dan kiriku ada dua anak muda yang masih belia. Seakan aku tidak percaya atas keberadaan mereka disitu. Lalu salah seorang di antara keduanya berkata secara rahasia padaku agar tidak diketahui oleh temannya. ‘Wahai paman! Tunjukkan padaku, dimana Abu Jahal!”. Lalu aku berkata: ‘Wahai anak saudaraku, apa yang akan kamu lakukan? Dia menjawab: “Aku diberitahu bahwa dia mencaci maki Rasulallah shalallahu ‘alaihi wa sallam. Demi Dzat yang jiwaku berada ditanganNya, jika aku melihatnya, maka dia tidak akan luput dari incaranku hingga ada yang mati terlebih dahulu di antara kami’. Mendengar hal itu, aku jadi terkesima. Dan setelah itu, yang seorang lagi mengedipkan matanya padaku dan berkata sebagaimana yang dikatakan oleh temannya tadi. Maka tak berapa lama, aku melihat Abu Jahal berkeliling di tengah orang-orang. Lalu aku berkata: “Tidakkah kalian berdua melihat? Dialah orang yang kalian berdua tanyakan tadi”. Maka, keduanya cepat-cepat melesatkan pedang ke arahnya dan menyabetnya hingga berhasil membunuhnya. Kemudian keduanya menghadap Rasulallah shalallahu ‘alaihi wa sallam, lantas mengabarkannya, lalu beliau bertanya: ‘Siapa diantara kalian berdua yang telah membunuhnya? Maka, masing-masing dari keduanya sama-sama mengklaim ‘Akulah yang telah membunuhnya’. Lalu beliau melihat ke arah kedua pedang tersebut seraya berkata: “Kalian berdua telah membunuhnya”.Kedua anak muda tersebut adalah Mu’adz bin Amr bin al-Jamuh dan Mu’adz bin Afra. Lalu Rasulallah shalallahu ‘alaihi wa sallam memberikan harta rampasan Abu Jahal kepada Mu’adz bin Amr bin al-Jamuh”. Di riwayatkan oleh Bukhari dan Muslim dari Anas bin Malik radhiyallahu ‘anhu, beliau berkata: “Rasulullah shalallahu ‘alaihi wa sallam bersama tatkala usai perang Badar: “Siapa yang melihat apa yang terjadi dengan Abu Jahal”. Lantas Abu Mas’ud berpencar mencarinya, lalu dia menemukannya dalam keadaan sedang menanti detik akhir ajalnya karena tebasan pedang anaknya Afra’. Dia lalu bertanya: ‘Apakah kamu Abu Jahal? Lantas dia menginjak lehernya dengan kakinya dan menarik jenggotnya agar dapat memenggal kepalanya. Abu Jahal berkata: ‘Apakah kamu injak orang yang telah mereka bunuh, atau orang yang dibunuh sama kaumnya sendiri”. Beliau menceritakan, telah berkata Abu Mijlaz: ‘Abu Jahal berkata pada waktu itu: ‘Andai saja yang membunuhku bukan seorang pembajak tanah (maksudnya orang Anshar yang pekerjaan mereka bercocok tanam). Dalam redaksinya Imam Bukhari dia mengatakan: ‘Andai yang membunuhku orang yang sepadan denganku”.Dirinya juga mengatakan kepada Ibnu Ma’sud tatkala itu: ‘Sungguh engkau telah melakukan pendakian yang amat sulit, wahai penggembala kambing! Lalu ia menambahkan: ‘Tolong beritahukan kepadaku, siapa yang keluar sebagai pemenang hari ini?. Ibnu Mas’ud menjawab: “Allah dan RasulNya”. Dirinya meregang maut ditangannya Bilal al-Habasyi, Umayyah adalah orang yang pernah menyisiksa Bilal ketika di Makah. Pada waktu itu yang mampu keluar dari mulutnya Bilal adalah Ahad, ahad. Hal itu, tidak mungkin bisa dilupakan begitu saja, itu merupakan cambukan diwajah muram orang yang lalim disetiap waktu dan tempat. Sungguh hal tersebut sangat mempengaruhi Bilal, akan tetapi pengaruh tersebut bukan untuk kepentingan dirinya sendiri, namun, demi membela kebenaran yang dipeganginya.Sudah saatnya berakhir perjalanan sang musuh, dan melihat dimana tempat perjalanan terakhirnya, sedang akibat yang baik itu bagi orang-orang yang bertakwa. Dan Nabi shalallahu ‘alaihi wa sallam telah mengabarkan kepada para sahabatnya akan kematian Umayyah bin Khalaf ini, hal itu sebagaimana dikisahkan oleh Abdurahman bin Auf radhiyallahu ‘anhu, dalam sebuah hadits yang diriwayatkan oleh Bukhari, beliau menceritakan: “Aku pernah menulis surat kepada Umayyah bin khalaf yang isinya agar dirinya mau menjaga keluarganya di Makah, dengan balasan aku akan menjaga keluarganya yang ada diMadinah, tatkala aku tulis ar-Rahman, maka dia berkata: ‘Aku tidak tahu siapa ar-Rahman, tulis saja namamu seperti ketika Jahilayah’. Aku pun akhirnya menuruti, maka aku tulis Abdu Amr. ketika terjadi perang Badar, aku keluar menjaganya ke atas gunung tatkala orang-orang sedang tertidur, namun, pada saat itu Bilal melihatnya. Dirinya lantas meloncat dan berdiri ditengah-tengah kaum sambil berteriak sekencang-kencangnya: ‘Umayyah bin Khalaf sang pemuka orang-orang kafir, aku tidak akan selamat jika dia selamat!”. Lalu orang-orang Anshar mengepung kami, tatkala aku khawatir mereka bisa mengejarku maka aku perintah anaknya supaya menjegal mereka, tapi anaknya pun berhasil diatasi dan mati terbunuh.  Kemudian mereka berhasil mengejar kami, Umayyah adalah orang gendut yang banyak lemaknya.  Akhirnya tatkala mereka berhasil mengejar kami, aku katakan padanya: ‘Duduklah, lalu ia duduk’. Selanjutnya Abdurahman memeluknya dari atas, lalu mereka pun menebaskan pedang-pedang mereka dari bawah hingga berhasil membunuhnya. Sebagian pedang itu malah mengenai kaki Abdurahman bin Auf. Dan beliau pernah memperlihatkan kepada kami bekas luka sabetan pedang tersebut dikakinya”. Akhirnya kita tutup dengan mengucapkan segala puji bagi Allah, Rabb semesta alam. Shalawat serta salam semoga senantiasa Allah curahkan kepada Nabi kita Muhammad, pada keluarga beliau serta para sahabatnya."
},
{
    "id": 3,
	"topik": "Perang Sawiq",
    "isi": "Seorang tokoh Quraisy yang selamat dari sergapan Rasulullah Shallallahu ‘alaihi wa sallam dan para Sahabat, yang bernama Abu Sufyân, menyimpan dendam menyusul kekalahan kaum kafir dalam perang Badar.  Secara diam-diam, dia berangkat ke Madinah dengan membawa 200 orang pasukan berkuda. Pada tanggal 5 Dzulhijjah pada tahun kedua hijrah, Abu Sufyan beserta pasukan memasuki Madinah. Dia langsung menuju Bani Nadhir di daerah pinggiran Madinah. Setelah bergabung dengan Bani Nadhir, mereka menyerang dari lembah Uraidh. Mereka berhasil membunuh dua orang Muslimin serta membakar kebun kurma; Kemudian mereka kembali ke Mekah. Ketika kaum Muslimin mengetahui tindakan balas dendam ini, di bawah pimpinan Rasulullah Shallallahu ‘alaihi wa sallam [2] mereka berusaha menyusul pasukan Abu Sufyaan sampai ke Qarqaratul Kadr, namun tidak berhasil. Akhirnya mereka kembali ke Madinah dengan membawa as-sawîq (tepung) yang dibuang pasukan Abu Sufyân untuk mengurangi beban agar bisa lari lebih cepat. Oleh karena itu, peperangan ini disebut dengan Ghazwatus Sawîq."
 },
  {
    "id": 4,
	"topik": "Perang Qarqarah",
    "isi": "Pada pertengahan Muharram tahun kedua dari hijrah nabi Shallallahu ‘alaihi wa sallam , Rasulullah Shallallahu ‘alaihi wa sallam keluar Madinah dengan dua ratus pasukan. Tindakan ini beliau Shallallahu ‘alaihi wa sallam ambil, setelah mendengar ada persekongkolan untuk menyerang kaum Muslimin yang dilakukan oleh kabilah-kabilah yang selama ini meraup keuntungan dari bisnis kaum Quraisy, karena daerah mereka dilalui oleh kafilah dagang Quraisy. Di antaranya adalah kabilah-kabilah dari Bani Sulaim dan Bani Ghatafân serta beberapa kabilah lainnya. Mereka berkumpul di Qarqarah al-Kudri yaitu sumber mata air milik Bani Sulaim. Ketika mendengar kabar tentang kedatangan Rasulullah Shallallahu ‘alaihi wa sallam beserta pasukannya, mereka melarikan diri dan meninggalkan ternak mereka menjadi ghanimah bagi Rasulullah Shallallahu ‘alaihi wa sallam . Bukan hanya ternak tapi juga penggembalanya yang bernama Yasar. Saat pembagian ghanimah, Yasar diserahkan kepada Rasulullah Shallallahu ‘alaihi wa sallam lalu dibebaskan oleh Rasulullah Shallallahu ‘alaihi wa sallam."
 },
{
    "id": 5,
	"topik": "Ka’ab Al-Asyraf, sang penghasut",
    "isi": "Orang dinisbatkan  ke Bani Nabhaan dari Thayyi’. Orang tua Ka’ab ini pernah melakukan pembunuhan pada masa jahiliyah lalu dia pergi ke Madinah. Di Madinah, dia bergabung dengan Bani Nadhiir dan menikahi Uqailah putri Abul Haqiiq. Dari hasil pernikahan ini, lahirlah Ka’ab bin al-Asyraaf. Ka’aab seorang Penyair terkenal. Dia sangat geram dengan kemenangan yang dipetik Kaum Muslimin dalam Perang Badar. Setelah perang Badar usai, dia sengaja pergi ke Mekah untuk menyatakan bela sungkawa kepada kaum kufaar Quraisy atas korban yang berjatuhan dari pihak mereka dan sekaligus membakar semangat mereka untuk membalas. Orang ini juga mencaci maki Rasulullah Shallallahu ‘alaihi wa sallam. Ketika di Mekah, Abu Sufyaan bertanya kepada Ka’b bin al-Asyraf : “Saya mau bertanya kepadamu dengan nama Allah, apakah agama kami yang lebih dicintai Allah ataukah agama Muhammad dan para shahabatnya ? Siapakah diantara kami yang lebih dekat ke hidayah dan yang lebih mendekati kebenaran ?” Ka’b menjawab : “Jalan kalian lebih lurus.” Lalu Allah Azza wa Jalla menurunkan firman-Nya kepada Rasulullah: Apakah kamu tidak memperhatikan orang-orang yang diberi bahagian dari Al kitab? mereka percaya kepada jibt dan thaghut, dan mengatakan kepada orang-orang kafir (musyrik Mekah), bahwa mereka itu lebih benar jalannya dari orang-orang yang beriman.[an-Nisa’/4:51]. Ketika Ka’b bin al-Asyraf kembali ke Madinah, dia melantunkan syair yang berisi sanjungan terhadap kaum Muslimah. Karena orang ini telah menghasut kaum Kuffaar, juga mencaci maki Rasulullah padahal kaum Yahudi Madinah sudah terikat perjanjian dengan Rasulullah untuk tidak membantu orang yang memusuhi Rasulullah Shallallahu ‘alaihi wa sallam , akhirnya Rasulullah Shallallahu ‘alaihi wa sallam memerintahkan agar orang ini dibunuhu sebagai hukuman dan shock teraphy bagi yang lainnya. Rasulullah Shallallahu ‘alaihi wa sallam menawarkan tugas ini kepada para shahabat beliau Shallallahu ‘alaihi wa sallam. Mendengar tawaran ini, Muhammad bin Maslamah Radhiyallahu anhu salah seorang shahabat menyatakan kesediaannya untuk melaksanakan tugas berat ini. Muhammad bin Maslamah membuat rencana matang untuk melaksanakan tugas ini. Dia meminta ijin kepada Rasulullah Shallallahu ‘alaihi wa sallam untuk mengucapkan perkataan yang menyenangkan Ka’b, si Yahudi yang mengkhianati perjanjian ini. Rasulullah Shallallahu ‘alaihi wa sallam memberikan ijin kepada beliau Radhiyallahu anhu untuk melakukannya. Mendengar ini, Ka’b mengatakan : Demi Allah, kalian akan semakin sengsara karena orang ini.” Lalu Muhammad bin Maslamah mengatakan : “Sesungguhnya sekarang kami telah mengikutinya dan kami tidak ingin meninggalkannya sebelum kami mengetahui akhir urusan orang ini (maksudnya Muhammad Shallallahu ‘alaihi wa sallam). Muhammad bin Maslamah Radhiyallahu anhu melanjutkan : “Aku ingin kamu meminjamkan sesuatu kepadaku ?” Ka’b bertanya : “Apa jaminanmu ?” Muhammad bin Maslamah menjawab : “Apa yang kamu minta sebagai jaminan ?” Awalnya, Ka’b meminta istri-istri para shahabat sebagai jaminannya, namun permintaan ini tidak bisa dipenuhi oleh Muhammad bin Maslamah. Lalu dia minta anak-anak mereka sebagai jaminan, namun permintaan inipun ditolak. Akhirnya mereka sepakat untuk menjadikan senjata sebagai jaminan dalam akad pinjam-meminjam itu. Setelah terjadi kesepakatan antara Muhammad bin Maslamah dengan Ka’b, dia berjanji kepada Ka’b untuk dating lagi kepadanya dengan ditemani Harits bin Bisyr, Abbaad bin Bisyr, Abu Na’ilah serta Abu Abbas bin Jabr. Pada malam yang telah dijanjikan, mereka dating kepada Ka’b dan memintanya untuk menemui mereka. Ka’b keluar menemui mereka, meskipun dia sudah diperingatkan oleh istrinya yang merasakan firasat buruk. Dia tetap keluar dan akhirnya kesempatan ini tidak disia-siakan oleh para shahabat untuk memberi pelajaran kepada sang pengkhianat itu. Ketika orang-orang Yahudi mengetahui kejadian ini dan menjadikannya sebagai argument, Rasulullah Shallallahu ‘alaihi wa sallam menjelaskan kepada mereka perbuatan-perbuatan yang telah dilakukan Ka’b bin al-Asyraf. Mereka terkaget dan merasa khawatir terhadap keselamatan diri mereka. Melihat ini, Rasulullah Shallallahu ‘alaihi wa sallam mengajak mereka untuk membuat perjanjian damai diantara mereka. Lalu terbentuklah perjanjian damai, sebagaimana disebutkan dalam riwayat Abu Daud. Namun menurt pendapat yang kuat, perjanjian damai ini hanya sebagai penguat dari perjanjian damai yang pernah disepakati sebelum terjadi Perang Badar antara kaum Muslimin dengan orang-orang Yahudi Madinah yang dikenal dengan Shahifah Madinah (Piagam Madinah)."
 },
{
    "id": 6,
	"topik": "Perang Uhud Bagian 1",
    "isi": "Pengalaman pahit yang dirasakan oleh kaum Quraisy dalam perang Badar telah menyisakan luka mendalam nan menyakitkan. Betapa tidak, walaupun jumlah mereka jauh lebih besar dan perlengkapan perang mereka lebih memadai, namun ternyata mereka harus menanggung kerugian materi yang tidak sedikit. Dan yang lebih menyakitkan mereka adalah hilangnya para tokoh mereka. Rasa sakit ini, ditambah lagi dengan tekad untuk mengembalikan pamor Bangsa Arab yang telah terkoyak dalam Perang Badar, mendorong mereka melakukan aksi balas dendam terhadap kaum Muslimin. Sehingga terjadilah beberapa peperangan setelah Perang Badar. Perang Uhud termasuk di antara peperangan dahsyat yang terjadi akibat api dendam ini. Disebut perang Uhud karena perang ini berkecamuk di dekat bukit Uhud. Sebuah bukit dengan ketinggian 128 meter kala itu, sedangkan sekarang ketinggiannya hanya 121 meter. Bukit ini berada di sebelah utara Madinah dengan jarak 5,5 km dari Masjid Nabawi. Para Ahli Sirah sepakakat bahwa perang ini terjadi pada bulan Syawwâl tahun ketiga hijrah Rasulullâh Shallallahu ‘alaihi wa sallam ke Madinah. Namun mereka berselisih tentang harinya. Pendapat yang yang paling Masyhûr menyebutkan bahwa perang ini terjadi pada hari Sabtu, pertengahan bulan Syawwal. Di samping perang ini dipicu oleh api dendam sebagaimana disebutkan diawal, ada juga penyebab lain yang tidak kalah pentingnya yaitu misi menyelamatkan jalur bisnis mereka ke Syam dari kaum Muslimin yang dianggap sering mengganggu. Mereka juga berharap bisa memusnahkan kekuatan kaum Muslimin sebelum menjadi sebuah kekuatan yang dikhawatirkan akan mengancam keberadaan Quraisy. Inilah beberapa motivasi yang melatarbelakangi penyerangan yang dilakukan oleh kaum Quraisy terhadap kaum Muslimin di Madinah. Kaum Quraisy sejak dini telah mempersiapkan pasukan mereka. Barang dagangan dan keuntungan yang dihasilkan oleh Abu Sufyân beserta rombongan yang selamat dari sergapan kaum Muslimin dikhususkan untuk bekal pasukan mereka dalam perang Uhud. Untuk menyukseskan misi mereka dalam perang Uhud ini, kaum Quraisy berhasil mengumpulkan 3 ribu pasukan yang terdiri dari kaum Quraisy dan suku-suku yang loyal kepada Quraisy seperti Bani Kinânah dan penduduk Tuhâmah. Mereka memiliki 200 pasukan kuda dan 700 pasukan bertameng. Mereka mengangkat Khâlid bin al-Walîd sebagai komandan sayap kanan, sementara sayap kiri di bawah komando Ikrimah bin Abu Jahl. Mereka juga mengajak beberapa orang wanita untuk membangkitkan semangat pasukan Quraisy dan menjaga mereka supaya tidak melarikan diri. Sebab jika ada yang melarikan diri, dia akan dicela oleh para wanita ini. Tentang jumlah wanita ini, para Ahli Sirah berbeda pendapat. Ibnu Ishâq rahimahullah menyebutkan bahwa jumlah mereka 8 orang, al-Wâqidi rahimahullah menyebutkan 14 orang[4] sedangkan Ibnu Sa’d rahimahullah menyebutkan 15 wanita. Sebelum peperangan ini berkecamuk, Rasulullâh Shallallahu ‘alaihi wa sallam diperlihatkan peristiwa yang akan terjadi dalam perang ini melalui mimpi. Rasulullâh Shallallahu ‘alaihi wa sallam menceritakan mimpi ini kepada para Sahabatnya. Beliau Shallallahu ‘alaihi wa sallam bersabda: Saya bermimpi mengayunkan pedang lalu pedang itu patah. Itu (isyarat-pent) musibah yang menimpa kaum Muslimin dalam Perang Uhud. Kemudian saya ayunkan lagi pedang itu lalu pedang itu baik lagi, lebih baik dari sebelumnya. Itu (isyarat-pent) kemenangan yang Allah Azza wa Jalla anugerahkan dan persatuan kaum Muslimin. Dalam mimpi itu saya juga melihat seekor sapi – Dan apa yang  Allah lakukan itu adalah yang terbaik- Itu (isyarat) terhadap kaum Muslimin (yang menjadi korban) dalam perang Uhud. Kebaikan adalah kebaikan yang Allah Azza wa Jalla anugerahkan dan balasan kejujuran yang Allah Azza wa Jalla karuniakan setelah perang Badar. Rasulullâh Shallallahu ‘alaihi wa sallam menakwilkan mimpi beliau Shallallahu ‘alaihi wa sallam ini dengan kekalahan dan kematian yang akan terjadi dalam Perang Uhud. Saat mengetahui kedatangan Quraisy untuk menyerbu kaum Muslimin di Madinah, Rasulullâh Shallallahu ‘alaihi wa sallam mengajak para Sahabat bermusyawarah untuk mengambil tindakan terbaik. Apakah mereka tetap tinggal di Madinah menunggu dan menyambut musuh di kota Madinah ataukah mereka akan menyongsong musuh di luar Madinah ? Rasulullâh Shallallahu ‘alaihi wa sallam cenderung mengajak para Sahabat bertahan di Madinah dan melakukan perang kota, namun sekelompok kaum Anshâr g mengatakan, “Wahai Nabiyullâh ! Sesungguhnya kami benci berperang di jalan kota Madinah. Pada jaman jahiliyah kami telah berusaha menghindari peperangan (dalam kota), maka setelah Islam kita lebih berhak untuk menghindarinya. Cegatlah mereka (di luar Madinah)” ! Rasulullah Shallallahu ‘alaihi wa sallam bersiap untuk berangkat. Beliau Shallallahu ‘alaihi wa sallam mengenakan baju besi dan segala peralatan perang. Setelah menyadari keadaan, para Sahabat saling menyalahkan. Akhirnya, mereka mengatakan: “Rasulullâh Shallallahu ‘alaihi wa sallam menawarkan sesuatu, namun kalian mengajukan yang lain. Wahai Hamzah Radhiyallahu anhu , temuilah Rasulullâh Shallallahu ‘alaihi wa sallam dan katakanlah, ‘Kami mengikuti pendapatmu.’ Hamzah pun Radhiyallahu anhu datang menemui Rasulullâh Shallallahu ‘alaihi wa sallam dan mengatakan, ‘Wahai Rasulullâh, sesungguhnya para pengikutmu saling menyalahkan dan akhirnya mengatakan, ‘Kami mengikuti pendapatmu.’ Mendengar ucapan paman beliau ini, Rasulullâh Shallallahu ‘alaihi wa sallam bersabda : ‘Sesungguhnya jika seorang nabi sudah mengenakan peralatan perangnya, maka dia tidak akan menanggalkannya hingga terjadi peperangan’. Keputusan musyawarah tersebut adalah menghadang musuh di luar kota Madinah. Ibnu Ishâq rahimahullah dan yang lainnya menyebutkan bahwa `Abdullâh ibnu Salûl setuju dengan pendapat Rasulullâh Shallallahu ‘alaihi wa sallam untuk tetap bertahan di Madinah. Sementara at-Thabariy membawakan riwayat yang berlawanan dengan riwayat Ibnu Ishâq rahimahullah, namun dalam sanad yang kedua ini ada orang yang tertuduh dan sering melakukan kesalahan. Oleh karena itu, al-Bâkiriy dalam tesisnya lebih menguatkan riwayat yang dibawakan oleh Ibnu Ishâq rahimahullah."
 },
{
    "id": 7,
	"topik": "Perang Uhud Bagian 2",
    "isi": "Setelah bermusyawarah dengan para Sahabat, Rasûlullâh Shallallahu ‘alaihi wa sallam memutuskan untuk menyambut serangan kaum kafir Mekah dan sekitarnya di luar Madinah. Sebelum berangkat, Rasûlullâh Shallallahu ‘alaihi wa sallam membagi pasukan beliau Shallallahu ‘alaihi wa sallam menjadi tiga regu dan masing-masing diberi bendera. Bendera regu Muhâjirîn diserahkan kepada Mush’ab bin Umair Radhiyallahu anhu yang selanjutnya diganti oleh Ali bin Abu Thâlib Radhiyallahu anhu  setelah Mush’ab Radhiyallahu anhu wafat sebagai syahid di medan tempur, bendera Aus dibawa oleh Usaid bin Hudhair Radhiyallahu anhu , dan satu bendera lagi yaitu bendera Khazraj dipercayakan kepada al-Habbâb bin al-Mundzir Radhiyallahu anhu. Rasûlullâh Shallallahu ‘alaihi wa sallam meninggalkan Madinah pada hari Jum’at bersama dengan seribu pasukan. Di antara mereka ada satu orang penunggang kuda dan 100 orang yang mengenakan baju besi. Rasûlullâh Shallallahu ‘alaihi wa sallam sendiri pada saat itu mengenakan dua lapis baju besi. Sebelum meninggalkan Madinah, Rasûlullâh Shallallahu ‘alaihi wa sallam memberikan amanah kepada `Abdullâh bin Ummi Maktûm Radhiyallahu anhu untuk mengimami shalat kaum Muslimin di Madinah. Ketika sudah melewati bukit Wadâ’, Rasûlullâh Shallallahu ‘alaihi wa sallam melihat sekelompok orang yang bersenjata lengkap. Rasûlullâh Shallallahu ‘alaihi wa sallam bertanya, “Siapa mereka ?” Para Sahabat menjawab, “Itu adalah `Abdullâh bin Ubay bin Salûl beserta teman-temannya orang-orang Yahudi Bani Qainuqâ’, kelompoknya `Abdullâh bin Salâm Radhiyallahu anhu yang berjumlah enam ratus.” Rasûlullâh Shallallahu ‘alaihi wa sallam bertanya lagi, “Apakah mereka sudah memeluk agama Islam ?” Para Sahabat menjawab, “Belum, wahai Rasulullâh.” Rasûlullâh Shallallahu ‘alaihi wa sallam bersabda, “Suruhlah mereka pulang! kita tidak akan meminta bantuan kepada orang-orang musyrik untuk menghadapi orang-orang musyrik juga. ika riwayat ini benar, berarti pengusiran terhadap Bani Qainuqâ’ itu terjadi setelah perang Uhud. Selanjutnya, Rasûlullâh Shallallahu ‘alaihi wa sallam dan kaum Muslimin melanjutkan perjalanan. Ketika sampai di as-Syauth (nama tempat), tokoh munafik yang bernama `Abdullâh bin Ubay bin Salûl diikuti oleh tiga ratus munafik lainnya yang membelot, kembali dan tidak mau ikut berperang. Mereka beralasan bahwa peperangan tidak akan terjadi. Pembelotan ini juga sebagai bentuk protes terhadap Rasûlullâh Shallallahu ‘alaihi wa sallam yang memutuskan untuk menyambut kedatangan musuh di luar Madinah. Dalam merespon tindakan buruk yang dilakukan oleh orang-orang munafik ini, para Sahabat terbagi menjadi dua kelompok. Satu kelompok berpendapat agar kaum Muslimin menyerang dan memberi pelajaran kepada orang-orang munafik ini, sementara satu kelompok lagi memandang tidak perlu menyerang mereka. Menyaksikan pembelotan `Abdullâh bin Ubay bin Salûl ini, `Abdullâh bin ‘Amr bin Harâm Radhiyallahu anhu menyusul mereka dan mengingatkan mereka agar kembali dan bergabung dengan Rasûlullâh Shallallahu ‘alaihi wa sallam . Namun upaya ini gagal dan mereka tetap menolak. Akhirnya, `Abdullâh bin ‘Amr bin Harâm Radhiyallahu anhu geram dan mengatakan, “Semoga Allah Azza wa Jalla menjauhkan kalian dari rahmat-Nya, wahai musuh-musuh Allah ! Allah Azza wa Jalla pasti akan menjadikan Nabi-Nya tidak butuh pada kalian. Ketika itu, Bani Salamah dari suku Khazraj dan Bani Hâritsah dari suku Aus hampir saja ikut mundur dan bergabung bersama orang-orang munafik, namun Allah Azza wa Jalla memberikan mereka keteguhan hati untuk tetap bertahan dengan kaum Muslimin. Rasulullâh beserta kaum Muslimin terus melanjutkan perjalanan. Ketika tiba di daerah Syaikhân, mereka beristirahat dan bermalam di sana. Di sinilah, Rasûlullâh Shallallahu ‘alaihi wa sallam memerintahkan kepada beberapa pemuda untuk kembali dan tidak memperkenankan mereka ikut terjun ke medan tempur. Hal ini disebabkan karena usia mereka yang masih terlalu muda, yaitu masih berusia empat belas tahun ke bawah. Di antara mereka yang disuruh pulang adalah `Abdullâh bin Umar, Zaid bin Tsâbit, Usâmah bin Zaid, Nu’mân bin Basyîr, Zaid bin Arqam, Barrâ’ bin ‘âzib dan lain-lain g [7], termasuk di antara yang ditolak oleh Rasûlullâh Shallallahu ‘alaihi wa sallam adalah Ibnu Umar Radhiyallahu anhuma [8] . Jumlah anak-anak muda yang diperintahkan oleh Rasûlullâh Shallallahu ‘alaihi wa sallam untuk kembali ini sekitar 14 orang. Pada saat yang sama, Rasûlullâh Shallallahu ‘alaihi wa sallam memberikan ijin (ikut berperang) kepada Râfi’ bin Khadîj Radhiyallahu anhu karena dia ahli memanah juga memberikan ijin kepada Samurah bin Jundub karena dia lebih kuat dibandingkan Râfi’. Saat itu, usia keduanya juga sudah lima belas tahun. Oleh karena itu, ada yang berpendapat bahwa Rasûlullâh Shallallahu ‘alaihi wa sallam memberikan ijin kepada mereka karena usia mereka yang sudah lima belas tahun, bukan karena kemampuan mereka. Pada malam ini, Dzakwân bin `Abdil Qais Radhiyallahu anhu senantiasa berjaga-jaga, bahkan ada yang mengatakan, beliau Radhiyallahu anhu tidak pernah meninggalkan Rasûlullâh Shallallahu ‘alaihi wa sallam."
},
{
    "id": 8,
	"topik": "Perang Uhud Bagian 3",
    "isi": "Pembelotan yang dilakukan oleh kaum munafiqin menyebabkan jumlah pasukan kaum Muslimin berkurang. Namun, ini tidak mengendorkan semangat tempur para Sahabat Nabi Shallallahu ‘alaihi wa sallam . Setelah menginap pada malam itu, pada harinya yaitu Sabtu pagi, kaum Muslimin melanjutkan perjalanan menuju bukit Uhud. Ketika sudah sampai di sana, Rasûlullâh Shallallahu ‘alaihi wa sallam mulai mengatur strategi. Rasûlullâh Shallallahu ‘alaihi wa sallam memerintahkan pasukan kaum Muslimin untuk membelakangi bukit Uhud dan menghadap ke Madinah. Rasûlullâh Shallallahu ‘alaihi wa sallam juga menempatkan 50 orang pemanah untuk berada di puncak bukit ‘Ainain. Tugas para pemanah yang dipimpin oleh ‘Abdullâh bin Jubair Radhiyallahu anhu ini adalah melindungi kaum Muslimin yang berada di bawah bukit dari serangan kaum kafir Quraisy yang mungkin dilakukan dari arah belakang kaum Muslimin. Rasûlullâh Shallallahu ‘alaihi wa sallamn melarang keras para pemanah ini meninggalkan tempat mereka ini, meskipun dalam keadaan genting kecuali ada perintah dari Rasûlullâh Shallallahu ‘alaihi wa sallam . Rasûlullâh Shallallahu ‘alaihi wa sallam bersabda: Meskipun kalian melihat kami disambar burung, janganlah kalian meninggalkan tempat kalian ini sampai aku mengutus utusan kepada kalian. Meskipun kalian melihat kami telah berhasil mengalahkan mereka, maka janganlah kalian meninggalkan tempat kalian ini sampai aku mengutus utusan kepada kalian. Dengan strategi ini, kaum Muslimin berhasil menguasai dataran-dataran yang tinggi dan membiarkan lembah untuk pasukan Quraisy menghadap ke bukit Uhud dan membelakangi Madinah. Ketika kedua pasukan yang berlawanan ini mulai semakin mendekat, Abu ‘Amir memanggil kaumnya yaitu kabilah Aus untuk bergabung bersamanya di barisan kaum kafir Quraisy. Mendengar seruan ini, para Sahabat menolaknya dengan keras. Mereka mengatakan, “Wahai orang fasik ! Semoga Allah Azza wa Jalla tidak memberikan kenikmatan kepadamu !” Mendengar jawaban yang tidak diharapkan ini, dia pun kembali dengan penuh kedongkolan. Setelah itu, pertempuran sengit antara dua pasukan ini tak terhindarkan lagi. Pasukan Muslimin bertempur dengan penuh semangat, tekad mereka hanya untuk membunuh atau terbunuh. Sehingga dalam waktu singkat mereka berhasil memukul mundur pasukan Quraisy ke markas mereka sampai mendekati barisan kaum wanita yang mendukung mereka. Untuk semakin mengobarkan semangat tempur para Sahabat Radhiyallahu anhum , Rasûlullâh Shallallahu ‘alaihi wa sallam menghunus pedang sambil bersabda, “Siapakah yang mau mengambil pedang ini dariku ?” Seluruh Sahabat yang mendengar ini sontak mengacungkan tangan sebagai isyarat bahwa mereka menginginkannya. Semua mengatakan, “Saya! Saya.” Rasûlullâh Shallallahu ‘alaihi wa sallam bersabda lagi, “Siapakah yang bersedia mengambilnya beserta haknya ?” Mendengar ini, para Sahabat menahan diri. Lalu Abu Dujânah Radhiyallahu anhu mengatakan, “Saya bersedia mengambilnya beserta haknya.” Lalu Abu Dujânah Radhiyallahu anu mengambilnya dan mempergunakannya untuk membabat tubuh-tubuh musuh Islam. Para Sahabat bertempur dengan penuh kesatria. Telah tercatat dalam lembaran sejarah keberanian yang ditunjukkan oleh Hamzah bin ‘Abdul Muththalib Radhiyallahu anhu juga para Sahabat yang lain. Ketika beliau Radhiyallahu anhu mendengar tantangan dari salah seorang kafir Quraisy yang bernama Sibâ’ bin ‘Abdil Uzzâ, beliau Radhiyallahu anhu bergegas menyambut tantangan tersebut. Beliau Radhiyallahu anhu berhasil mengalahkan orang kafir tersebut. Sementara di tempat lain, ada Wahsyi, budak hitam milik Jubair bin Muth’im yang selalu mengintai kesempatan untuk menyerang Hamzah Radhiyallahu anhu. Oleh tuannya, Wahsyi dijanjikan merdeka jika berhasil menghabisi Hamzah Radhiyallahu anhu , sebagai pembalasan terhadap Hamzah Radhiyallahu anhu yang telah membunuh Thu’aimah bin ‘Adi dalam perang Badar. Dia mengendap-ngendap berusaha mendekati Hamzah Radhiyallahu anhu , ketika melihat Hamzah Radhiyallahu anhu berada dalam jangkauan serangannya, dia mulai membidik Hamzah Radhiyallahu anhu dengan tombaknya dan melemparnya. Lemparannya tepat mengenai sasaran sehingga menyebabkan Hamzah Radhiyallahu anhu wafat sebagai syahid dalam peperangan ini. Wahsyi berhasil membunuh Hamzah Radhiyallahu anhu dengan cara yang sangat curang. Sementara itu, peperangan terus berlangsung. Mush’ab bin Umair Radhiyallahu anhu terus bertempur sambil membawa bendera sampai akhirnya beliau Radhiyallahu anhu gugur. Selanjutnya, bendera dibawa oleh Ali bin Abi Thâlib Radhiyallahu anhu . Kaum Muslimin terus berjuang sehingga memaksa kaum Kafir mundur. Pada babak pertama ini, kaum Muslimin berhasil memenangkan pertarungan. Ketika melihat pasukan musuh lari tunggang langgang, pasukan `Abdullâh bin Jubair Radhiyallahu anhu mengatakan : “Ghanîmah … Ayo kawan-kawan ! ghanîmah … teman-teman kalian sudah menang, tunggu apa lagi ?” Mendengar ajakan ini, `Abdullâh Radhiyallahu anhu berusaha mengingatkan, “Apakah kalian telah lupa pesan Rasulullâh n kepada kalian ?” Mereka menjawab, “Demi Allah ! Kami akan mendatangi mereka kemudian mengambil ghanîmah !” Lalu mereka bergegas meninggalkan tempat itu dan melanggar pesan Rasulullah. Mereka ikut serta mengumpulkan ghanîmah. Melihat kaum Muslimin tersibukkan oleh ghanîmah, Khâlid bin Walîd sebagai salah satu komandan kaum Quraisy tidak menyia-nyiakan kesempatan emas ini. Dia memerintahkan pasukannya untuk kembali ke medan tempur. Mendapatkan serangan dadakan dan tak terduga ini, jelas membuat kaum Muslimin kelabakan dan kocar-kacir serta membuat suasana jadi kacau tak terkendali. Sampai-sampai kaum Muslimin kesulitan untuk membedakan antara kawan dan lawan. Dalam suasana kacau inilah, kaum Muslimin menyerang dan membunuh al-Yamân, orang tua Sahabat yang bernama Hudzaifah, padahal Hudzaifah Radhiyallahu anhu sudah berteriak bahwa yang sedang mereka serang itu adalah ayahnya. Akhirnya, al-Yamân meninggal di tangan kaum Muslimin. Setelah memastikan orang tuanya meninggal, Hudzaifah Radhiyallahu anhu mengatakan, “Semoga Allah Azza wa Jalla mengampuni kalian”. Dalam pertempuran babak kedua ini, banyak kaum Muslimin yang gugur sebagai syahid. Kaum Muslimin juga kehilangan Rasûlullâh Shallallahu ‘alaihi wa sallam dan tersiar kabar bahwa beliau Shallallahu ‘alaihi wa sallam telah gugur. Berbagai tindakan dilakukan oleh kaum Muslimin sebagai respon terhadap berita wafatnya Rasulullah Shallallahu ‘alaihi wa sallam. Ada yang lari meninggalkan medan tempur, sebagian terdiam tidak mau bertempur lagi, sementara sebagian lagi terus berjuang dan berusaha mengobarkan semangat tempur kaum Muslimin. Di antara yang terus berjuang dan mengobarkan semangat kaum Muslimin yaitu Anas bin Nadhar Radhiyallahu anhu yang bertekad menebus ketidakikutsertaannya dalam perang Badar. Ketika melihat sebagian kaum Muslimin diam tidak bersemangat lagi, beliau Radhiyallahu anhu mengatakan, “Surga, demi Rabbnya Nadhar! Sungguh aku mencium bau surga di balik Uhud !” Kemudian beliau Radhiyallahu anhu maju bertempur sampai gugur sebagai syahid. Ketika jasad beliau ditemukan, tidak ada seorang Sahabat pun yang bisa mengenalinya karena begitu banyak luka tusuk akibat tombak atau panah dan sayatan pedang di tubuh beliau Radhiyallahu anhu."
},
{
    "id": 9,
	"topik": "Perang Khandaq",
    "isi": "Menurut pendapat jumhur Ulama, perang Khandaq terjadi pada bulan Syawwal tahun lima hijriyah dan sebagian Ulama yang lain menyebutkan bahwa peperangan ini berkecamuk pada bulan Syawwal tahun keempat hijriyah. Al-Baihaqi memandang bahwa pada dasarnya kedua pendapat ini tidak beda. Karena yang berpendapat perang ini terjadi pada tahun ke-4 maksudnya empat tahun setelah Rasûlullâh hijrah ke Madinah dan sebelum tahun ke-5 berakhir. Pemicu perang Khandaq ini dendam lama orang-orang Yahudi yang di usir oleh Rasûlullâh dari Madinah dalam perang Bani Nadhir. Mereka diusir karena mereka menghianati perjanjian yang dibuat dengan Rasûlullâh Shallallahu ‘alaihi wa sallam. Sejumlah tokoh Yahudi Bani Nadhir dan Bani Wa’il seperti Sallam bin abil Huqaiq, Hayyi bin Akhtab, Kinanah bin abil Huqaiq, Hauzah bin Qais al-Wa’iliy dan Abu Ammar al-Wa’iliy berangkat ke Mekah untuk mengajak kaum musyrikin Quraisy memerangi Rasûlullâh Shallallahu ‘alaihi wa sallam. Mereka berjanji, “Kami akan bersama kalian berperang sampai berhasil menghancurkan kaum Muslimin.” Mereka juga meyakinkan kaum Quraisy dengan mengatakan, “Agama kalian itu lebih baik daripada agama Muhammad.” Setelah sepakat dengan kaum Quraisy, tokoh tokoh Yahudi ini mendatangi suku Gathafan. Dalam pertemuan dengan tokoh Gathafan mereka mencapai dua kesepakatan yaitu suku Gathafan bersedia mengirim pasukan sebanyak-banyak untuk bergabung dengan pasukan sekutu menyerang kaum Muslimin, sebagai imbalannya, kaum Yahudi akan menyerahkan hasil panen kurma Khaibar kepada suku Gathafan selama setahun penuh. Berkat kegigihan para tokoh Yahudi Bani Nadhir dan Wa’il menggalang dukungan, akhirnya sebuah pasukan sekutu berkekutan sangat besar pun terbentuk. Ibnu Ishâq menyebutkan bahwa jumlah pasukan sekutu  adalah sepuluh ribu pasukan yang terdiri dari kaum musyrik Quraisy, qabilah Gathafan beserta qabilah-qabilah yang ikut bergabung bersama mereka. Oleh karena pasukan orang-orang kafir ini terdiri dari berbagai kelompok, maka peperangan ini disebut juga dengan perang Ahzâb (beberapa kelompok). Komando tertinggi dipegang oleh Abu sufyan. Sementara pasukan kaum Muslimin hanya berjumlah tiga ribu saja dan bisa jadi jumlah musuh melebihi jumlah seluruh Madinah kala itu. Ketika berita persekongkolan dan rencana busuk orang-orang kafir ini sampai ke Rasûlullâh Shallallahu ‘alaihi wa sallam, beliau Shallallahu ‘alaihi wa sallam  langsung meresponnya dengan melakukan persiapan. Diantara persiapan itu adalah, diantara kebiasaan Rasûlullah yaitu mengajak para sahabat beliau n bermusyawarah tentang hal-hal yang tidak ada wahyunya dari Allah, baik berkaitan dengan peperangan atau yang semisalnya. Rasûlullâh Shallallahu ‘alaihi wa sallam meminta pendapat para sahabat tentang strategi dalam perang ini. Salah seorang shahabat yang bernama Salmân al-Farisy mengusulkan agar kaum Muslimin menggali khandaq (parit) di sebelah utara Madinah yang merupakan satu satunya jalan terbuka yang bisa di lewati musuh apabila ingin memasuki kota Madinah. Ide brilian Salman Radhiyallahu anhu ini disetujui oleh Rasûlullâh dan para sahabat lainnya. Setelah mencapai kata mufakat, akhirnya penggalian khandaq (parit) pun dimulai. Inilah penggalian parit pertama dalam sejarah Arab. Setelah sepakat untuk menggali parit  sesuai usul Salmân al-Fârisiy, kaum Muslimin pun bergegas untuk melaksanakannya. Parit yang diharapkan bisa memisahkan kaum Muslimin dengan musuh ini terus dikebut pengerjaannya supaya bisa selesai sebelum musuh datang ke Madinah. Para Ulama ahli sirah berbeda pendapat tentang waktu yang dibutuhkan untuk penggalian parit ini, berkisar antara enam sampai dua puluh empat hari. Para shahabat sangat bersemangat dan antusias menggali parit karena Rasûlullâh juga ikut bersama mereka dan tidak jarang mereka meminta bantuan Rasûlullâh untuk memecahkan batu batu besar yang tidak sanggup mereka pecahkan. Untuk memompa semangat para shahabat, Rasûlullâh berkali kali melantunkan sya’ir yang kemudian dijawab oleh para shahabat. Seorang shahabat al-Barrâ` bin Azib bercerita, “Pada waktu perang Ahzâb atau Khandaq, aku melihat Rasulullah mengangkat tanah parit, sehingga debu-debu itu menutupi kulit beliau dari (pandangan)ku. Demikianlah semangat kaum Muslimin ketika menggali parit yang bisa diselesaikan dalam waktu yang relatif singkat untuk ukuran saat itu, dengan berbagai kendalaseperti kekurangan peralatan, kurang makanan, cuaca Madinah yang sangat dingin ditambah lagi dengan sikap orang-orang munafiq yang terus berusaha mengikis semangat para sahahabat. Meski demikian, semangat yang didasari iman yang kuat membuat mereka tidak pernah surut membela agama Allâh dan Rasul-Nya. Pasca penggalian parit Rasûlullâh Shallallahu ‘alaihi wa sallam memerintahkan agar para wanita dan anak kecil ditempatkan di salah satu benteng terkuat di Madinah milik Bani Haritsah[11] dan beliau Shallallahu ‘alaihi wa sallam menunjuk Abdullah bin Ummi maktum Radhiyallahu anhu untuk menggantikannya di Madinah selama peperangan. Kemudian Rasûlullâh Shallallahu ‘alaihi wa sallam mulai menyusun setrategi untuk menghadapi musuh. Beliau n menyuruh para shahabat untuk membelakangi gunung Sila’, menghadap khandaq yang sekaligus sebagai penghalang mereka dari pasukan sekutu."
},
{
    "id": 10,
	"topik": "Perang Mut'ah",
    "isi": "Mu’tah adalah nama sebuah desa di daerah Balqa’ di Syam. Peperangan yang terjadi pada bulan Jumadal Ula tahun 8 H ini disebut pula dengan Ghazwatu Jaisyil Umara’, artinya perang pasukan para pemimpin. Disebut demikian, karena banyaknya jumlah pasukan kaum Muslimin yang kala itu mencapai 3000 personel, dan sengitnya pertempuran melawan pihak kafir. Menurut Ibnu Ishâq rahimahullah, dalam perang ini Rasûlullâh Shallallahu ‘alaihi wa sallam mengutus pasukan yang dipimpin Zaid bin Hâritsah Radhiyallahu anhu seraya berpesan, “Bila Zaid terbunuh, maka Ja’far bin Abi Thâlib yang menggantikan. Dan bila Ja’far terbunuh, maka Abdullâh bin Rawâhah yang menggantikan”. Kaum Muslimin menyambut dengan suka cita para komandan yang disebut Rasûlullâh Shallallahu ‘alaihi wa sallam tadi dan mengucap salam kepada mereka saat pasukan mulai berangkat. Ketika pasukan menyalami Abdullâh bin Rawâhah Radhiyallahu anhu, mereka melihat ia menangis. Sehingga ditanyakan kepadanya, “Apa yang membuatmu menangis, hai Ibnu Rawâhah ?” Abdullâh bin Rawâhah Radhiyallahu anhu menjawab, “Demi Allâh, aku bukan mencintai dunia maupun menangisi kalian, akan tetapi, aku mendengar Rasûlullâh Shallallahu ‘alaihi wa sallam membaca ayat tentang neraka yang bunyinya, Setiap kalian pasti akan melewatinya. Itu adalah ketetapan Allâh yang pasti terlaksana), maka aku tidak tahu, bagaimana aku keluar setelah melewatinya?”. Maka kaum Muslimin menimpali, “Semoga Allâh menyertai dan membela kalian, dan semoga kalian kembali kepada kami dalam keadaan baik-baik”. Pasukan kaum Muslimin pun terus bergerak hingga singgah di sebuah daerah bernama Ma’an di Syam. Mereka mendengar Raja Hiraklius dengan 100 ribu pasukan Romawi telah tiba di Balqa’ dan diperkuat lagi dengan 100 ribu pasukan dari sejumlah kabilah Arab yang loyal kepada Romawi, seperti Lakham, Judzam, Qain, dan Bahra’. Mendengar besarnya jumlah pasukan musuh, kaum Muslimin sempat menetap di Ma’an selama dua malam, sembari memikirkan keadaan mereka dan kembali mengatur strategi yang mesti diterapkan. Mereka mengusulkan agar berkirim surat kepada Rasûlullâh Shallallahu ‘alaihi wa sallam dan memberitahukan jumlah pasukan musuh. Harapannya, supaya beliau n mengirim pasukan tambahan atau menetapkan suatu keputusan untuk mereka taati. Melihat gelagat kaum Muslimin yang ragu untuk berperang, maka Abdullâh ibnu Rawâhah pun menggelorakan semangat. Ia berseru, “Wahai kaum, apa yang kalian takutkan adalah sesuatu yang kalian kejar selama ini, yaitu mati syahid. Kita memerangi mereka bukan karena jumlah maupun kekuatan kita. Namun kita memerangi mereka karena agama Islam yang dengannya Allâh memuliakan kita. Berangkatlah! Yang ada hanyalah satu dari dua kebaikan, kemenangan atau mati syahid!”. Mendengar seruan itu, pasukan kaum Muslimin tergugah semangatnya dan menyambutnya, “Sungguh benar ucapan Ibnu Rawâhah”. Pasukan pun kembali bergerak maju hingga tiba di perbatasan Balqa’, tepatnya di salah satu desa yang bernama Masyârif. Di sana mereka mendapati pasukan Hiraklius yang terdiri dari bangsa Romawi dan Arab. Ketika musuh mendekat, pasukan kaum Muslimin bergeser ke desa lain yang bernama Mu’tah, hingga di desa itulah kedua pasukan saling berhadapan. Kaum Muslimin telah siaga dengan menunjuk Qutbah bin Qatâdah Radhiyallahu anhu sebagai komandan sayap kanan dan di sayap kiri didaulatlah ‘Ubâdah bin Mâlik al-Anshâri Radhiyallahu anhu. Perang sengit berkecamuk. Zaid bin Hâritsah Radhiyallahu anhu melesat ke barisan musuh dengan membawa panji-panji Rasûlullâh Shallallahu ‘alaihi wa sallam . Dia berperang penuh semangat menerjang barisan musuh hingga syahid tertusuk tombak musuh. Panji-panji pun lantas diambil alih oleh Ja’far bin Abi Thâlib Radhiyallahu anhu . Perang kembali berkecamuk. Tetapi Ja’far Radhiyallahu anhu tidak mendapatkan celah untuk keluar dari kepungan musuh. Dia pun meloncat dari atas punggung kuda tunggangannya dan menebas keempat kaki kudanya lalu menyeruak ke tengah barisan musuh hingga akhirnya syahid pula. Dan Ja’far adalah orang Islam pertama yang membunuh kudanya di medan perang. Ibnu Hisyâm rahimahullah meriwayatkan dari sejumlah Ulama yang dianggapnya tsiqah, bahwa Ja’far bin Abi Thâlib Radhiyallahu anhu memegang panji-panji dengan tangan kanannya, akan tetapi kemudian ditebas oleh musuh hingga putus. Dia pun lantas memegangnya dengan tangan kirinya yang kemudian juga ditebas oleh musuh hingga putus. Maka didekaplah panji-panji itu dengan pangkal lengannya hingga iapun gugur dalam usia 33 tahun. Karena pengorbanannya tadi, Allâh Azza wa Jalla mengganti kedua tangannya dengan sepasang sayap, sehingga ia bebas terbang sesukanya di dalam Jannah. Setelah Ja’far Radhiyallahu anhu terbunuh, panji-panji diambil alih oleh Abdullâh bin Rawâhah Radhiyallahu anhu dan ia pun menerjang maju. Beberapa saat ia berusaha turun dari kudanya, akan tetapi dihinggapi keraguan, lalu ia bersyair untuk menguatkan tekadnya dan meniru kedua sahabatnya yang telah gugur. Ibnu Rawâhah Radhiyallahu anhu akhirnya juga turun dari kudanya, dan ia dihampiri sepupunya yang membawa sepotong tulang dengan menyisakan sedikit daging, seraya berkata, “Makanlah agar kekuatanmu pulih!”. Ibnu Rawâhah pun mengambil daging tadi dan memakannya. Namun baru sekali menggigitnya, ia mendengar suara hiruk-pikuk dari arah tertentu, dan katanya, “Engkau masih di dunia!”. Mendengar seruan, serta merta dilemparlah daging itu. Sambil menghunus pedangnya, ia maju lagi dan terus berperang hingga syahid. Radhiyallâhu‘anhum. Setelah terbunuhnya ketiga panglima tadi, panji-panji diambil oleh Tsâbit bin Arqam al- ‘Ajlani seraya berseru, “Wahai kaum Muslimin, tunjuklah seseorang agar memimpin kalian!”. “Engkau saja !” sahut mereka. “Tidak, aku tidak akan menerimanya!” jawab Tsabit. Akhirnya mereka sepakat untuk menunjuk Khâlid ibnul Walîd sebagai panglima. Begitu Khâlid mengambil panji-panji itu, dia pun berusaha menolak serangan musuh dan menyelamatkan sisa-sisa pasukan kaum Muslimin, lalu menyingkir dari medan perang. Dalam Shahîhul Bukhâri disebutkan, setelah Ibnu Rawâhah terbunuh, Rasûlullâh mengatakan panji-panji kemudian diambil oleh salah satu pedang Allâh, maksudnya Khâlid ibnul Walîd Radhiyallahu anhu , lalu Allâh Azza wa Jalla memenangkan mereka. Ibnu Ishâq rahimahullah menuturkan, setelah mengetahui Ja’far Radhiyallahu anhu dan sahabat-sahabatnya menemui syahid, maka Rasûlullâh Shallallahu ‘alaihi wa sallam menjenguk Asma’ binti Umeis Radhiyallahu anha, istri Ja’far. Ketika itu Asma’ Radhiyallahu anhatelah menyiapkan adonan roti, memandikan anak-anak Ja’far dan mendandaninya. Rasûlullâh Shallallahu ‘alaihi wa sallam lantas memanggil anak-anaknya tersebut dan menciuminya sambil bercucuran air mata. Asma’ bertanya, “Biarlah ayah dan ibuku yang menjadi tebusanmu. Apa yang membuatmu menangis, wahai Rasûlullâh ? Adakah engkau mendengar sesuatu tentang Ja’far dan sahabat-sahabatnya?”. “Ya, mereka telah gugur hari ini,” jawab Rasûlullâh Shallallahu ‘alaihi wa sallam. Mendengar berita dari Rasûlullâh Shallallahu ‘alaihi wa sallam , maka Asma’ pun berteriak hingga kaum wanita datang mengerumuninya. Rasûlullâh Shallallahu ‘alaihi wa sallam lantas keluar dan kembali ke rumahnya. Beliau pun berseru, “Jangan lupa untuk membuatkan makanan bagi keluarga Ja’far, sebab mereka sedang disibukkan dengan kematian Ja’far”. Ibnu Ishâq rahimahullah meriwayatkan dari Muhammad bin Ja’far, dari Urwah bin Zubair, katanya, “Ketika pasukan kaum Muslimin telah mendekati perbatasan Madînah, Rasûlullâh Shallallahu ‘alaihi wa sallam menghampiri mereka bersama kaum Muslimin. Anak-anak kecil pun berlarian menyambut mereka, sedangkan Rasûlullâh Shallallahu ‘alaihi wa sallam ikut masuk bersama pasukan dengan mengendarai untanya. Rasûlullâh Shallallahu ‘alaihi wa sallam memerintahkan agar anak-anak digendong kembali, dan supaya putera Ja’far dibawa kehadapannya. Maka didatangkanlah Abdullâh bin Ja’far yang kemudian digendong oleh Rasûlullâh Shallallahu ‘alaihi wa sallam “. Orang-orang lantas menaburkan pasir ke arah pasukan sambil meneriaki mereka sebagai orang-orang yang lari dari jihad fi sabilillah! Akan tetapi Rasûlullâh menyanggah ucapan tersebut dengan mengatakan, “Mereka bukanlah orang-orang yang melarikan diri, namun mereka akan balik menyerang insya Allâh.” Menurut Ibnu Katsir, riwayat ini mursal (terputus sanadnya) dan mengandung keanehan. Beliau menganggap Ibnu Ishaq telah salah faham dalam menyitir redaksinya, sehingga mengira bahwa yang dicemooh tadi adalah sebagian besar pasukan. Padahal cemoohan tersebut hanya ditujukan kepada sebagian orang yang lari ketika berhadapan dengan musuh. Adapun pasukan lainnya tidak lari namun justru menang, sebagaimana yang dikabarkan oleh Rasûlullâh di atas mimbar, bahwa panji-panji lalu dipegang oleh salah satu pedang Allâh, dan Allâh memenangkan mereka. Karenanya, kaum Muslimin tidak mungkin menjuluki mereka sebagai orang-orang yang lari setelah mendengar sabda Nabi tadi. Mereka justru menyambut pasukan tersebut dengan penuh hormat dan bangga. Mereka hanya mencemooh dan menaburkan pasir kepada orang-orang yang lari dan meninggalkan pasukan saat di medan perang. Salah satu dari mereka yang lari adalah Abdullâh bin Umar, sebagaimana penuturannya berikut: “Aku pernah ikut dalam suatu ekspedisi militer yang dikirim Rasûlullâh. Tatkala orang-orang lari berhamburan, aku ikut lari bersama mereka. Kami lantas saling bertanya,’Apa yang harus kita lakukan?’ Kita telah lari dari medan perang dan mendapat murka Allâh?,’ lalu kami berkata,’Andai saja kita masuk ke kota Madinah dan bermalam di sana tanpa terlihat seorang pun,’ lalu setelah kami masuk, kami berkata,’Alangkah baiknya jika kita menyerahkan diri kepada Rasûlullâh. Kalau memang kita bisa bertaubat, maka kita akan tinggal di sana. Namun jika kita tidak bisa bertaubat, maka kita akan pergi kembali,’ maka kami menghampiri Rasûlullâh menjelang shalat Subuh. Usai shalat kami menghadap beliau seraya berkata,’Wahai, Rasûlullâh! Kami adalah orang-orang yang melarikan diri,’ beliau lantas menatap kami dan bersabda,‘Justru kalian adalah orang-orang yang menyerang musuh,’  maka kami mendekati beliau dan mencium tangannya. Kata kami, ‘Wahai, Rasûlullâh! Mulanya kami hendak melakukan ini dan itu…,, namun beliau menyanggah,‘Akulah pasukan induk kaum Muslimin’."
}
]